Examinator/src/InformationRegisters/ИспользованиеДополнительныхМатериаловСУЗ/ИспользованиеДополнительныхМатериаловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеДополнительныхМатериаловСУЗ</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДополнительныеМатериалыПользователейСУЗ/ДополнительныеМатериалыПользователейСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеМатериалыПользователейСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/CommonForms/ДополнительныеМатериалыСУЗ/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		ПоказатьТребующиеПроверки = ДанныеНастроек.Получить("ПоказатьТребующиеПроверки");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Общие.Отбор, "Проверено", Ложь,,,?(ПоказатьТребующиеПроверки, Истина, Ложь));
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказатьТребующиеПроверкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Общие.Отбор, "Проверено", Ложь,,,?(ПоказатьТребующиеПроверки, Истина, Ложь));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИспользование

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Использование

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.Ссылка);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбщие

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Общие

&НаКлиенте
Процедура ОбщиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьТекущийОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ОбщиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьИспользованиеДополнительныхМатериалов(Команда)
	
	ТекущиеДанные = Элементы.Использование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьИспользование(ТекущиеДанные.Ссылка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЭлектронномуРесурсу(Команда)
	
	ТекущиеДанные = Элементы.Общие.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбъектыСУЗКлиент.ОткрытьОбозреватель(ТекущиеДанные.ЭлектронныйРесурс, ТекущиеДанные.ЭлементСодержания);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверено(Команда)
	
	ТекущаяСтрока = Элементы.Общие.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Общие.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныйМатериалПроверен(ТекущиеДанные.Дата, ?(ЗначениеЗаполнено(ТекущиеДанные.ЭлементСодержания), ТекущиеДанные.ЭлементСодержания, ТекущиеДанные.ЭлектронныйРесурс));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОбъект(Команда)
	ОткрытьТекущийОбъект();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьИспользование(ЭлектронныйРесурс)
	
	ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "ЭтоГруппа");
	
	Если ЭтоГруппа Тогда
		
		Текст = НСтр("ru = 'Для выполнения операции выберите элемент справочника'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИспользованиеДополнительныхМатериаловСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	Иначе
		НоваяЗапись = НаборЗаписей[0];
	КонецЕсли;
	
	НоваяЗапись.ЭлектронныйРесурс = ЭлектронныйРесурс;
	НоваяЗапись.Использование     = ?(НоваяЗапись.Использование, Ложь, Истина);

	НаборЗаписей.Записать();
	
	Элементы.Использование.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныйМатериалПроверен(Период, ЭлементСодержания)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	
	Запись.Проверено = ?(Запись.Проверено, Ложь, Истина);
	Запись.ДатаПроверки = ТекущаяДата();
	Запись.Проверяющий = Пользователи.ТекущийПользователь();
	
	НаборЗаписей.Записать();
	
	Элементы.Общие.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийОбъект()
	
	ТекущиеДанные = Элементы.Общие.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаОбъектСУЗ) Тогда
		ПоказатьЗначение(,ТекущиеДанные.СсылкаНаОбъектСУЗ);
	Иначе
		Оповещение = Новый ОписаниеОповещения("РедактироватьЭлементДополнительныхМатериаловПродолжение", ЭтотОбъект, Новый Структура("Дата, Автор, ЭлементСодержания", ТекущиеДанные.Дата, ТекущиеДанные.Автор, ТекущиеДанные.ЭлементСодержания));
		ПоказатьВводСтроки(Оповещение, ТекущиеДанные.Текст, НСтр("ru = 'Текст дополнительного материала'"), 0, Истина);						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЭлементДополнительныхМатериаловПродолжение(Текст, ДопПараметры) Экспорт
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДополнительныйМатериал(ДопПараметры.Дата, ДопПараметры.Автор, ДопПараметры.ЭлементСодержания, Текст);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДополнительныйМатериал(Знач Период, Знач Автор, Знач ЭлементСодержания, Знач Текст)
	
	РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.ЗаписатьМатериал(Период, ЭлементСодержания, Автор,,, Текст,,,Ложь);
	
	Элементы.Общие.Обновить();
	
КонецФункции


#КонецОбласти
